Revit 2027 API
TableCellStyle.TextColor Property
 The text color of this cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color TextColor { get; set; }
Public Property TextColor As Color
	Get
	Set
public:
property Color^ TextColor {
	Color^ get ();
	void set (Color^ value);
}
member TextColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace